/**
 * Игровой интерфейс!
 * Описываем абстрактные методы которые д.б. обязательно реализованы в класах
 * реализуемых этим интерфейсом
 * все методы описанные в интерфейсе публичные (и должны быть обязательно реализованы!)
 * Описываем методы для возвращения без параметров
 * для добавления методов и последующих их добавлениях (удобно дописывать методы, без множества изменених и поисков в др.классах)
 */
package org.example.units;

public interface GameInterface {
    void step();            // эти методы абстрактные по умолчанию, т.к. они в public interface
    String getInfo();
}
